[
  {
    "name": "Week 1",
    "theme": "The Parable of the Sower",
    "scripture_passage": "Mark 4:14 - 'The farmer sows the word.'",
    "reflection": "The Parable of the Sower challenges us to be good soil for God's Word. How can you receive His Word this week?",
    "prayer": "Lord, make my heart good soil for Your Word, that it may bear fruit in my life. Amen.",
    "activity": "Read the Parable of the Sower (Mark 4:1-20) and journal about the state of your heart.",
    "youtube_link": "https://www.youtube.com/embed/GFMPyNVOfDo"
  },
  {
    "name": "Week 2",
    "theme": "Faith in Action",
    "scripture_passage": "James 2:17 - 'In the same way, faith by itself, if it is not accompanied by action, is dead.'",
    "reflection": "Our faith should lead to action. How can you put your faith into practice this week?",
    "prayer": "Lord, let my faith be alive through my actions, reflecting Your love to others. Amen.",
    "activity": "Choose one practical way to live out your faith, such as helping a friend or sharing your testimony.",
    "youtube_link": "https://www.youtube.com/embed/e_soSuY0MAA"
  },
  {
    "name": "Week 3",
    "theme": "The Vine and the Branches",
    "scripture_passage": "John 15:5 - 'I am the vine; you are the branches. If you remain in me and I in you, you will bear much fruit.'",
    "reflection": "Jesus calls us to remain in Him. How can you stay connected to Him this week?",
    "prayer": "Jesus, help me to remain in You, the true vine, so I can bear fruit for Your glory. Amen.",
    "activity": "Spend extra time in prayer or scripture reading to deepen your connection with Christ.",
    "youtube_link": "https://www.youtube.com/embed/xpcHDsfAmKs"
  },
  {
    "name": "Week 4",
    "theme": "The Greatest Commandment",
    "scripture_passage": "Matthew 22:37-38 - 'Jesus replied: “Love the Lord your God with all your heart and with all your soul and with all your mind. This is the first and greatest commandment.”'",
    "reflection": "Love God with all your heart, soul, and mind. How can you prioritize your love for Him this week?",
    "prayer": "Lord, I want to love You with all that I am. Deepen my devotion to You. Amen.",
    "activity": "Set aside time each day this week to worship God through prayer, song, or gratitude.",
    "youtube_link": "https://www.youtube.com/embed/jy2W-crIVeM"
  },
  {
    "name": "Week 5",
    "theme": "The Parable of the Talents",
    "scripture_passage": "Matthew 25:21 - 'His master replied, “Well done, good and faithful servant! You have been faithful with a few things; I will put you in charge of many things.”'",
    "reflection": "God entrusts us with gifts to use for His Kingdom. How can you use your talents this week?",
    "prayer": "Lord, help me to be a faithful steward of the gifts You've given me, for Your glory. Amen.",
    "activity": "Identify one talent or skill you have and use it to bless someone this week.",
    "youtube_link": "https://www.youtube.com/embed/2H04PVJ5AF0"
  },
  {
    "name": "Week 6",
    "theme": "The Bread of Life",
    "scripture_passage": "John 6:35 - 'Then Jesus declared, “I am the bread of life. Whoever comes to me will never go hungry, and whoever believes in me will never be thirsty.”'",
    "reflection": "Jesus is the Bread of Life, sustaining us. Come to Him this week for spiritual nourishment.",
    "prayer": "Jesus, You are the Bread of Life. Nourish my soul with Your presence. Amen.",
    "activity": "Attend a Eucharist service (if applicable) or spend time reflecting on Christ's presence in your life.",
    "youtube_link": "https://www.youtube.com/embed/kGxo-1Fs2r4"
  },
  {
    "name": "Week 7",
    "theme": "Humility",
    "scripture_passage": "Philippians 2:3 - 'Do nothing out of selfish ambition or vain conceit. Rather, in humility value others above yourselves.'",
    "reflection": "Jesus modeled humility. How can you practice humility in your interactions this week?",
    "prayer": "Lord, teach me to be humble, valuing others above myself, as You did. Amen.",
    "activity": "Let someone else go first (e.g., in line, in conversation) as a small act of humility.",
    "youtube_link": "https://www.youtube.com/embed/5ssz33FT8co"
  },
  {
    "name": "Week 8",
    "theme": "The Prodigal Son",
    "scripture_passage": "Luke 15:20 - 'But while he was still a long way off, his father saw him and was filled with compassion for him; he ran to his son, threw his arms around him and kissed him.'",
    "reflection": "God's mercy is boundless, as shown in the Prodigal Son. Return to Him with any struggles this week.",
    "prayer": "Father, thank You for Your mercy. Welcome me back into Your arms, no matter how far I've strayed. Amen.",
    "activity": "Read the Parable of the Prodigal Son (Luke 15:11-32) and reflect on God's love for you.",
    "youtube_link": "https://www.youtube.com/embed/lOETMpUcrjY"
  },
  {
    "name": "Week 9",
    "theme": "The Good Samaritan",
    "scripture_passage": "Luke 10:33 - 'But a Samaritan, as he traveled, came where the man was; and when he saw him, he took pity on him.'",
    "reflection": "The Good Samaritan shows us how to love our neighbor. Look for opportunities to show compassion this week.",
    "prayer": "Lord, make me a good Samaritan, showing compassion to those in need around me. Amen.",
    "activity": "Help someone in need, whether through a kind word, a donation, or a helping hand.",
    "youtube_link": "https://www.youtube.com/embed/jBCjEzjV1yU"
  },
  {
    "name": "Week 10",
    "theme": "Gratitude",
    "scripture_passage": "1 Thessalonians 5:18 - 'Give thanks in all circumstances; for this is God's will for you in Christ Jesus.'",
    "reflection": "Gratitude transforms our perspective. What are you thankful for this week?",
    "prayer": "Lord, fill my heart with gratitude for Your blessings, in all circumstances. Amen.",
    "activity": "Make a list of 10 things you're thankful for and thank God for each one.",
    "youtube_link": "https://www.youtube.com/embed/Vpl3ojhq6H8"
  },
  {
    "name": "Week 11",
    "theme": "The Light of the World",
    "scripture_passage": "Matthew 5:14 - 'You are the light of the world. A town built on a hill cannot be hidden.'",
    "reflection": "Jesus calls us to be His light in the world. How can you shine for Him this week?",
    "prayer": "Jesus, let me be Your light, shining brightly for others to see Your love. Amen.",
    "activity": "Share an encouraging word or deed that reflects Christ's light to someone.",
    "youtube_link": "https://www.youtube.com/embed/eqD0f1Dgb_g"
  },
  {
    "name": "Week 12",
    "theme": "Perseverance",
    "scripture_passage": "Galatians 6:9 - 'Let us not become weary in doing good, for at the proper time we will reap a harvest if we do not give up.'",
    "reflection": "Perseverance in faith leads to a harvest. Keep doing good, even when it's hard.",
    "prayer": "Lord, give me strength to persevere in doing good, trusting in Your timing. Amen.",
    "activity": "Choose one good habit (e.g., daily prayer) and commit to it this week, even if it's challenging.",
    "youtube_link": "https://www.youtube.com/embed/1mn_MJklfpY"
  },
  {
    "name": "Week 13",
    "theme": "The Lost Sheep",
    "scripture_passage": "Luke 15:4 - 'Suppose one of you has a hundred sheep and loses one of them. Doesn't he leave the ninety-nine in the open country and go after the lost sheep until he finds it?'",
    "reflection": "Jesus seeks the lost with love. How can you reach out to someone who feels lost this week?",
    "prayer": "Jesus, thank You for seeking me when I was lost. Help me to seek others with Your love. Amen.",
    "activity": "Reach out to someone who might feel lonely or lost, offering them encouragement.",
    "youtube_link": "https://www.youtube.com/embed/qkGIf_O8l1Q"
  },
  {
    "name": "Week 14",
    "theme": "Stewardship",
    "scripture_passage": "1 Peter 4:10 - 'Each of you should use whatever gift you have received to serve others, as faithful stewards of God's grace in its various forms.'",
    "reflection": "We are stewards of God's gifts. How can you use your time, talents, or resources for Him this week?",
    "prayer": "Lord, make me a faithful steward of Your gifts, using them to serve others. Amen.",
    "activity": "Donate time, money, or resources to a cause that serves others.",
    "youtube_link": "https://www.youtube.com/embed/rzv1P1Hz4vE"
  },
  {
    "name": "Week 15",
    "theme": "The Cost of Discipleship",
    "scripture_passage": "Luke 14:27 - 'And whoever does not carry their cross and follow me cannot be my disciple.'",
    "reflection": "Following Jesus requires sacrifice. What is He calling you to surrender this week?",
    "prayer": "Jesus, help me to carry my cross and follow You, even when it's difficult. Amen.",
    "activity": "Identify one area of your life to surrender to God and pray about it daily this week.",
    "youtube_link": "https://www.youtube.com/embed/bxTWDuKviU8"
  },
  {
    "name": "Week 16",
    "theme": "The Power of Prayer",
    "scripture_passage": "Philippians 4:6 - 'Do not be anxious about anything, but in every situation, by prayer and petition, with thanksgiving, present your requests to God.'",
    "reflection": "Prayer connects us to God's peace. Bring your concerns to Him this week.",
    "prayer": "Lord, I bring my worries to You in prayer, trusting in Your peace. Amen.",
    "activity": "Set aside 5 minutes each day to pray about your concerns and thank God for His peace.",
    "youtube_link": "https://www.youtube.com/embed/AemfX3h5T20"
  },
  {
    "name": "Week 17",
    "theme": "The Parable of the Workers",
    "scripture_passage": "Matthew 20:16 - 'So the last will be first, and the first will be last.'",
    "reflection": "God's grace is generous and often surprising. Trust in His fairness and love for all.",
    "prayer": "Lord, thank You for Your generous grace. Help me to trust in Your ways. Amen.",
    "activity": "Read the Parable of the Workers in the Vineyard (Matthew 20:1-16) and reflect on God's grace.",
    "youtube_link": "https://www.youtube.com/embed/GE2GUkLLEnA"
  },
  {
    "name": "Week 18",
    "theme": "Community",
    "scripture_passage": "Hebrews 10:24-25 - 'And let us consider how we may spur one another on toward love and good deeds, not giving up meeting together.'",
    "reflection": "We grow in faith through community. How can you connect with other believers this week?",
    "prayer": "Lord, strengthen my relationships with other believers, that we may encourage each other. Amen.",
    "activity": "Attend a church service or small group, or reach out to a fellow believer for encouragement.",
    "youtube_link": "https://www.youtube.com/embed/nuyC_dD3Sgc"
  },
  {
    "name": "Week 19",
    "theme": "The Rich Young Man",
    "scripture_passage": "Mark 10:21 - 'Jesus looked at him and loved him. “One thing you lack,” he said. “Go, sell everything you have and give to the poor, and you will have treasure in heaven. Then come, follow me.”'",
    "reflection": "Jesus challenges us to let go of attachments. What might He be asking you to release?",
    "prayer": "Jesus, help me to let go of anything that holds me back from fully following You. Amen.",
    "activity": "Declutter one area of your life (e.g., donate unused items) as a symbol of releasing attachments.",
    "youtube_link": "https://www.youtube.com/embed/UZl75ER5NHA"
  },
  {
    "name": "Week 20",
    "theme": "The Widow's Offering",
    "scripture_passage": "Mark 12:43-44 - 'Calling his disciples to him, Jesus said, “Truly I tell you, this poor widow has put more into the treasury than all the others.”'",
    "reflection": "God values the heart behind our giving. Give generously, even in small ways, this week.",
    "prayer": "Lord, let me give with a generous heart, trusting You to use my offerings. Amen.",
    "activity": "Give a small, sacrificial gift to someone or a cause, focusing on the heart behind your giving.",
    "youtube_link": "https://www.youtube.com/embed/700YXx9Wnbo"
  },
  {
    "name": "Week 21",
    "theme": "The Ten Commandments",
    "scripture_passage": "Exodus 20:3 - 'You shall have no other gods before me.'",
    "reflection": "The Ten Commandments guide us in loving God and others. Reflect on how you can live them out.",
    "prayer": "Lord, help me to follow Your commandments, loving You and others as You desire. Amen.",
    "activity": "Read the Ten Commandments (Exodus 20:1-17) and choose one to focus on this week.",
    "youtube_link": "https://www.youtube.com/embed/wLgR2I-IE6g"
  },
  {
    "name": "Week 22",
    "theme": "The Parable of the Net",
    "scripture_passage": "Matthew 13:47 - 'Once again, the kingdom of heaven is like a net that was let down into the lake and caught all kinds of fish.'",
    "reflection": "The Kingdom of Heaven gathers all people. Pray for those who don't yet know Christ.",
    "prayer": "Lord, let Your Kingdom grow, gathering all people into Your love. Amen.",
    "activity": "Pray for someone you know who doesn't know Christ, asking God to draw them to Himself.",
    "youtube_link": "https://www.youtube.com/embed/01VaOsG2iF0"
  },
  {
    "name": "Week 23",
    "theme": "Hope in Christ",
    "scripture_passage": "Romans 15:13 - 'May the God of hope fill you with all joy and peace as you trust in him, so that you may overflow with hope by the power of the Holy Spirit.'",
    "reflection": "Christ is our hope. Let His hope fill you as Ordinary Time continues.",
    "prayer": "God of hope, fill me with joy and peace, that I may overflow with hope in You. Amen.",
    "activity": "Share a message of hope with someone who is struggling this week.",
    "youtube_link": "https://www.youtube.com/embed/O6AotbzAVIw"
  },
  {
    "name": "Week 24",
    "theme": "The Second Coming",
    "scripture_passage": "Matthew 24:44 - 'So you also must be ready, because the Son of Man will come at an hour when you do not expect him.'",
    "reflection": "As Ordinary Time nears its end, we look forward to Christ's return. Are you ready for His coming?",
    "prayer": "Lord, prepare my heart for Your return, that I may be ready to welcome You. Amen.",
    "activity": "Reflect on your spiritual life and make one change to better prepare for Christ's return.",
    "youtube_link": "https://www.youtube.com/embed/7UaQItz27eY"
  },
  {
    "name": "Week 25",
    "theme": "Christ the King",
    "scripture_passage": "Revelation 19:16 - 'On his robe and on his thigh he has this name written: King of kings and Lord of lords.'",
    "reflection": "The last Sunday of Ordinary Time celebrates Christ the King. Proclaim Him as King of your life.",
    "prayer": "Jesus, You are the King of kings. Reign in my heart and life forever. Amen.",
    "activity": "Celebrate Christ the King by praying a prayer of surrender, crowning Him King of your life.",
    "youtube_link": "https://www.youtube.com/embed/FqAMDs2pDKk"
  },
  {
    "name": "Week 26",
    "theme": "Living in Expectation",
    "scripture_passage": "1 Thessalonians 5:2 - 'For you know very well that the day of the Lord will come like a thief in the night.'",
    "reflection": "As Ordinary Time extends, live in expectation of Christ's return, staying vigilant in faith.",
    "prayer": "Lord, keep me vigilant and ready for Your coming, living each day for You. Amen.",
    "activity": "Reflect on how you can live each day with eternity in mind, and journal your thoughts.",
    "youtube_link": "https://www.youtube.com/embed/Q610p3eistw"
  },
  {
    "name": "Week 27",
    "theme": "Faithful Endurance",
    "scripture_passage": "Hebrews 12:1 - 'Therefore, since we are surrounded by such a great cloud of witnesses, let us throw off everything that hinders and the sin that so easily entangles. And let us run with perseverance the race marked out for us.'",
    "reflection": "Run the race of faith with endurance as Ordinary Time continues, trusting God's strength.",
    "prayer": "Lord, give me strength to endure in faith, running the race You have set before me. Amen.",
    "activity": "Choose one spiritual discipline (e.g., fasting, prayer) to strengthen this week.",
    "youtube_link": "https://www.youtube.com/embed/SpycRDaCAho"
  },
  {
    "name": "Week 28",
    "theme": "God’s Abundant Grace",
    "scripture_passage": "2 Corinthians 9:8 - 'And God is able to bless you abundantly, so that in all things at all times, having all that you need, you will abound in every good work.'",
    "reflection": "God’s grace is sufficient for every moment. Trust in His provision as you serve Him.",
    "prayer": "Lord, thank You for Your abundant grace. Help me to abound in good works for Your glory. Amen.",
    "activity": "Perform a small act of service for someone, relying on God’s grace to guide you.",
    "youtube_link": "https://www.youtube.com/embed/27pQGc2pwpU"
  },
  {
    "name": "Week 29",
    "theme": "Seeking God’s Kingdom",
    "scripture_passage": "Matthew 6:33 - 'But seek first his kingdom and his righteousness, and all these things will be given to you as well.'",
    "reflection": "Prioritize God’s Kingdom in all you do, trusting Him to provide for your needs.",
    "prayer": "Lord, help me to seek Your Kingdom first, aligning my life with Your will. Amen.",
    "activity": "Dedicate time this week to pray for God’s Kingdom to advance in your community.",
    "youtube_link": "https://www.youtube.com/embed/o3gPB_Wl4go"
  },
  {
    "name": "Week 30",
    "theme": "Preparing for Advent",
    "scripture_passage": "Romans 13:11 - 'And do this, understanding the present time: The hour has already come for you to wake up from your slumber, because our salvation is nearer now than when we first believed.'",
    "reflection": "As Ordinary Time draws to a close, prepare your heart for the coming of Advent and Christ’s return.",
    "prayer": "Lord, awaken my heart to prepare for Advent and Your coming. Amen.",
    "activity": "Create a plan for how you will observe Advent, such as a daily scripture reading or prayer.",
    "youtube_link": "https://www.youtube.com/embed/sP2Hanx8hcc"
  }
]